""" Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
Ну і додатковим завданням є турбота про виведення.
Слово "день" підбирається на основі кількох днів, а години,
хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
Приклад:
0 -> 0 днів, 00:00:00
224930 -> 2 дні, 14:28:50
466289 -> 5 днів, 09:31:29          PRUKLAD
950400 -> 11 днів, 00:00:00
1209600 -> 14 днів, 00:00:00
1900800 - > 22 дні, 00:00:00
8639999 -> 99 днів, 23:59:59
22493 -> 0 днів, 06:14:53
7948799 -> 91 день, 23:59:59
Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек.
Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів,
годин, хвилин, а те що залишиться - це секунди, які менше 60 ;) """
ttime = 8639999
day = ttime // (24 * 60 * 60)
if day > 14:
    day = int(str(day)[-1])
hours = (ttime % (24 * 60 * 60)) // (60 * 60)
if len(str(hours)) == 1:
    hours = "0" + str(hours)
minutes = (ttime % (24 * 60 * 60)) % (60 * 60) // 60
if len(str(minutes)) == 1:
    minutes = "0" + str(minutes)
seconds = (ttime % (24 * 60 * 60)) % (60 * 60) % 60
if len(str(seconds)) == 1:
    seconds = "0" + str(seconds)
days = {0: "днів", 1: "день", 2: "дні", 3: "дні", 4: "дні", 5: "днів", 6: "днів", 7: "днів",
        8: "днів", 9: "днів", 10: "днів", 11: "днів", 12: "днів", 13: "днів", 14: "днів",}
print(f"{day} {days.get(day)}, {hours}:{minutes}:{seconds}")

