""" Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
Ну і додатковим завданням є турбота про виведення.
Слово "день" підбирається на основі кількох днів, а години,
хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
 0 -> 0 днів, 00:00:00
224930 -> 2 дні, 14:28:50
466289 -> 5 днів, 09:31:29
950400 -> 11 днів, 00:00:00
1209600 -> 14 днів, 00:00:00
1900800 - > 22 дні, 00:00:00
8639999 -> 99 днів, 23:59:59
22493 -> 0 днів, 06:14:53
7948799 -> 91 день, 23:59:59"""
ttime = int(input("Please enter the number of seconds :\n"))
if 0 <= ttime < 8640000:
    day = ttime // (24 * 60 * 60)
    key_day = day
    if day > 19:
        key_day = int(str(key_day)[-1])
    hours = (ttime % (24 * 60 * 60)) // (60 * 60)
    if len(str(hours)) == 1:
        hours = "0" + str(hours)
    minutes = (ttime % (24 * 60 * 60)) % (60 * 60) // 60
    if len(str(minutes)) == 1:
        minutes = "0" + str(minutes)
    seconds = (ttime % (24 * 60 * 60)) % (60 * 60) % 60
    if len(str(seconds)) == 1:
        seconds = "0" + str(seconds)
    days = {0: "днів", 1: "день", 2: "дні", 3: "дні", 4: "дні",
            5: "днів", 6: "днів", 7: "днів", 8: "днів", 9: "днів",
            10: "днів", 11: "днів", 12: "днів", 13: "днів", 14: "днів",
            15: "днів", 16: "днів", 17: "днів", 18: "днів", 19: "днів"}
    print(f"{day} {days.get(key_day)}, {hours}:{minutes}:{seconds}")
else:
    print("Error I cant")

